import time
import sys
import os

def typewriter(text, delay=0.02):
    for char in text:
        sys.stdout.write(char)
        sys.stdout.flush()
        time.sleep(delay)
    print()

logo = r"""
   ███████╗███████╗████████╗ ██████╗██╗  ██╗████████╗██╗   ██╗██████╗ ███████╗
   ██╔════╝██╔════╝╚══██╔══╝██╔════╝██║  ██║╚══██╔══╝██║   ██║██╔══██╗██╔════╝
   █████╗  █████╗     ██║   ██║     ███████║   ██║   ██║   ██║██████╔╝█████╗  
   ██╔══╝  ██╔══╝     ██║   ██║     ██╔══██║   ██║   ██║   ██║██╔══██╗██╔══╝  
   ██║     ███████╗   ██║   ╚██████╗██║  ██║   ██║   ╚██████╔╝██████╔╝███████╗
   ╚═╝     ╚══════╝   ╚═╝    ╚═════╝╚═╝  ╚═╝   ╚═╝    ╚═════╝ ╚═════╝ ╚══════╝

      ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
"""


RED = "\033[91m"
RESET = "\033[0m"


infos = [
    "                                  FATCHTUBE                                 ",
    "...",
    "Author: rwvthrdev",
    "Version: 1.0.0.0\n",
    "[1] Baixa vídeos com a maior qualidade",
    "[2] Retorna título e autor do vídeo",
    "[3] Necessita apenas da URL"
]

print(RED)
typewriter(logo, 0.001)

# Simular carregamento
for linha in infos:
    typewriter(linha, 0.03)
    time.sleep(0.3)

print(RESET)

time.sleep(2)

import ftube

